In [4]:
import pandas as pd

## Concat DataFrames

In [5]:
india_weather = pd.DataFrame({
    "city" :["mumbai","delhi","banglore"],
    "temperature" : [32,45,30],
    "humidity" : [80,60,78]    
})
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [6]:
us_weather = pd.DataFrame({
    "city" :["new york","chicsgo","orlando"],
    "temperature" : [21,14,35],
    "humidity" : [68,65,75]
})

us_weather

       city  temperature  humidity
0  new york           21        68
1   chicsgo           14        65
2   orlando           35        75

In [7]:
df = pd.concat([india_weather,us_weather ])                # merge two data frames
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0  new york           21        68
1   chicsgo           14        65
2   orlando           35        75

In [8]:
df = pd.concat([india_weather,us_weather],ignore_index = True)                  #fixed that above index error
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   chicsgo           14        65
5   orlando           35        75

In [9]:
df = pd.concat([india_weather,us_weather], keys = ['India','Us'])          
df

             city  temperature  humidity
India 0    mumbai           32        80
      1     delhi           45        60
      2  banglore           30        78
Us    0  new york           21        68
      1   chicsgo           14        65
      2   orlando           35        75

In [10]:
df.loc['India']

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [11]:
df.loc['Us']

       city  temperature  humidity
0  new york           21        68
1   chicsgo           14        65
2   orlando           35        75

In [12]:
temperature_df = pd.DataFrame({
    "city" : ["mumbai","delhi","baglore"],
    "temperature" :[32,45,30]
})
temperature_df

      city  temperature
0   mumbai           32
1    delhi           45
2  baglore           30

In [13]:
windspeed_df = pd.DataFrame({
    "city":["delhi","mumbai"],
    "windspeed" :[7,12]
},index=[1,0])                               ##  changed index for maching temperature_df data frame

windspeed_df

     city  windspeed
1   delhi          7
0  mumbai         12

In [14]:
pd.concat([temperature_df,windspeed_df], axis = 1 )          #  0 - index vice            1 - column vise

      city  temperature    city  windspeed
0   mumbai           32  mumbai       12.0
1    delhi           45   delhi        7.0
2  baglore           30     NaN        NaN

## Merge data frames

In [15]:
df2 = pd.DataFrame({
    "city" :["chicago","new york" ,"orlando"],
    "humadity" : [65,68,75]
})

In [16]:
df1 = pd.DataFrame({
    "city":["chicago","new york" ,"orlando"],
    "temperature" :[65,68,75]
})

In [17]:
df3 = pd.merge(df1,df2,on="city")
df3

       city  temperature  humadity
0   chicago           65        65
1  new york           68        68
2   orlando           75        75

In [18]:
df2 = pd.DataFrame({
    "city" :["chicago","new york","san-diego"],
    "humidity":[65,68,71]                                        #create data frame 2
})

In [19]:
df1 = pd.DataFrame({
    "city" :["new york","chicago","orlando","baltimore"],          # create data frame 1
    "temperature " :[21,14,35,38]
})

In [20]:
df1

        city  temperature
0   new york            21
1    chicago            14
2    orlando            35
3  baltimore            38

In [21]:
df2

        city  humidity
0    chicago        65
1   new york        68
2  san-diego        71

In [22]:
pd.merge(df1,df2 , on="city" , how ="inner")           # inner represents inner join

       city  temperature   humidity
0  new york            21        68
1   chicago            14        65

In [23]:
pd.merge(df1,df2 , on="city" , how ="left")          # left join              All the values from table one

        city  temperature   humidity
0   new york            21      68.0
1    chicago            14      65.0
2    orlando            35       NaN
3  baltimore            38       NaN

In [24]:
pd.merge(df1,df2 , on="city" , how ="right")         # right join            All the values from table two

        city  temperature   humidity
0    chicago          14.0        65
1   new york          21.0        68
2  san-diego           NaN        71

In [25]:
pd.merge(df1,df2 , on="city" , how ="outer")                   # full join all the values of table 1 and 2

        city  temperature   humidity
0   new york          21.0      68.0
1    chicago          14.0      65.0
2    orlando          35.0       NaN
3  baltimore          38.0       NaN
4  san-diego           NaN      71.0